{
    "Acne": {
        "descripcion": "El acné es una afección cutánea que ocurre cuando los folículos pilosos se obstruyen con grasa y células muertas de la piel, causando puntos negros, espinillas o granos.",
        "sintomas": "Aparición de granos, puntos negros, puntos blancos, inflamación o enrojecimiento en la piel, generalmente en la cara, pecho y espalda.",
        "tratamientos": "Limpieza facial regular, medicamentos tópicos como peróxido de benzoilo, retinoides o antibióticos, y en casos severos, medicamentos orales como isotretinoína."
    },
    "Actinic Keratosis": {
        "descripcion": "La queratosis actínica es una lesión cutánea causada por la exposición prolongada al sol, que puede aparecer como una mancha áspera o escamosa en la piel.",
        "sintomas": "Manchas ásperas o escamosas en áreas expuestas al sol, como el rostro, manos, cuero cabelludo o cuello. Estas lesiones pueden ser rosadas, rojas o marrones.",
        "tratamientos": "Crioterapia, cremas tópicas con fluorouracilo o imiquimod, terapia fotodinámica o, en algunos casos, extirpación quirúrgica."
    },
    "Basal Cell Carcinoma": {
        "descripcion": "El carcinoma de células basales es un tipo de cáncer de piel de crecimiento lento que suele desarrollarse en áreas expuestas al sol.",
        "sintomas": "Protuberancias brillantes o cerosas, úlceras que no cicatrizan, o manchas rojas planas que pueden sangrar o formar costras.",
        "tratamientos": "Cirugía para extirpar la lesión, crioterapia, radioterapia o medicamentos tópicos como imiquimod."
    },
    "Dermatofibroma": {
        "descripcion": "El dermatofibroma es un pequeño nódulo benigno que se forma en la piel, generalmente como resultado de una lesión menor o picadura de insecto.",
        "sintomas": "Nódulo firme, generalmente marrón o rojizo, que puede ser doloroso al tacto y se encuentra comúnmente en las piernas o brazos.",
        "tratamientos": "Generalmente no requiere tratamiento. En casos sintomáticos, puede eliminarse quirúrgicamente."
    },
    "Eczemaa": {
        "descripcion": "El eczema es una afección crónica de la piel caracterizada por inflamación, picazón y sequedad.",
        "sintomas": "Parches secos, enrojecidos y con picazón que pueden formar ampollas o exudados. Común en pliegues de la piel como codos, rodillas y cuello.",
        "tratamientos": "Hidratación regular, cremas con corticosteroides, antihistamínicos para la picazón y, en casos graves, inmunosupresores."
    },
    "Melanoma": {
        "descripcion": "El melanoma es un tipo agresivo de cáncer de piel que se origina en los melanocitos, las células productoras de pigmento.",
        "sintomas": "Lunares irregulares con bordes desiguales, múltiples colores y un tamaño mayor a 6 mm. También puede haber cambios en lunares preexistentes.",
        "tratamientos": "Extirpación quirúrgica, inmunoterapia, quimioterapia o radioterapia según el estadio del melanoma."
    },
    "Nevus": {
        "descripcion": "El nevus, o lunar, es una acumulación benigna de células pigmentadas en la piel.",
        "sintomas": "Manchas o protuberancias marrones, negras o rosadas que suelen ser redondas y de tamaño pequeño. Generalmente no cambian con el tiempo.",
        "tratamientos": "No requiere tratamiento a menos que se observen cambios sospechosos, en cuyo caso se recomienda extirpación y análisis."
    },
    "Pigmented benign keratosis": {
        "descripcion": "La queratosis benigna pigmentada es una lesión cutánea no cancerosa que suele aparecer con la edad.",
        "sintomas": "Manchas oscuras, marrones o negras, con una textura cerosa o verrugosa, frecuentemente en áreas expuestas al sol.",
        "tratamientos": "No es necesario tratarla, aunque se puede extirpar por motivos estéticos mediante crioterapia, láser o cirugía menor."
    },
    "Rosacea": {
        "descripcion": "La rosácea es una afección cutánea crónica que causa enrojecimiento, vasos sanguíneos visibles y, a veces, protuberancias similares al acné en la cara.",
        "sintomas": "Enrojecimiento persistente en el centro del rostro, vasos sanguíneos visibles, y en algunos casos, hinchazón o picazón.",
        "tratamientos": "Evitar desencadenantes, uso de cremas tópicas como metronidazol, antibióticos orales o terapia con láser para vasos visibles."
    },
    "Seborrheic keratosis": {
        "descripcion": "La queratosis seborréica es un crecimiento benigno de la piel que se desarrolla con el envejecimiento.",
        "sintomas": "Placas o protuberancias de color marrón, negro o amarillo con una apariencia cerosa o verrugosa.",
        "tratamientos": "No suele requerir tratamiento, pero se puede eliminar por razones estéticas con crioterapia, raspado o láser."
    },
    "Squamous cell carcinoma": {
        "descripcion": "El carcinoma de células escamosas es un tipo de cáncer de piel que se desarrolla en las capas superficiales de la piel.",
        "sintomas": "Áreas gruesas, escamosas o con costras que pueden sangrar o formar úlceras, generalmente en áreas expuestas al sol.",
        "tratamientos": "Extirpación quirúrgica, radioterapia o quimioterapia tópica con fluorouracilo o imiquimod."
    },
    "Vascular lesion": {
        "descripcion": "Las lesiones vasculares son anomalías en los vasos sanguíneos de la piel que pueden ser congénitas o desarrollarse con el tiempo.",
        "sintomas": "Manchas rojas, púrpuras o azuladas en la piel, como hemangiomas o malformaciones vasculares.",
        "tratamientos": "Terapia con láser, cirugía o medicamentos para reducir el tamaño o mejorar la apariencia de las lesiones."
    }
}
